Revit 2027 API
SlabShapeEditor.IsEnabled Property
Identifies if the slab shape editing functionality is enabled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEnabled { get; }
Public ReadOnly Property IsEnabled As Boolean
	Get
public:
property bool IsEnabled {
	bool get ();
}
member IsEnabled : bool with get
Property Value
Boolean
Remarks
 If true, the creases and vertices are accessible and modifiable. If false, no creases and vertices are accessible.
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace